{
  "backend/main.mo": "Stores contact messages and provides methods to submit and retrieve them with basic validation.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and tests.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment checklist outlining backend-first deployment flow and validation steps.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light/dark theme tokens for the app.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/public/elementor/README-elementor.txt": "Guide for embedding the static 3D cafe build into WordPress via Elementor with setup steps and limitations.",
  "frontend/src/App.tsx": "Main React app wiring the 3D scene, overlays, navigation UI, and onboarding logic.",
  "frontend/src/components/layout/ContourFrame.tsx": "UI frame component applying contour-themed background texture and styled container.",
  "frontend/src/components/layout/PanelSurface.tsx": "Reusable panel layout with header, close button, scrollable content, and contour framing.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button showing a tooltip and triggering the onboarding overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar with logo and buttons to open menu, about, contact, and export panels.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "Dialog overlay explaining movement, gaze, proximity, and interaction tips for first‑time users.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Tracks whether the user is visiting for the first time using localStorage and provides a dismiss handler.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for fetching and submitting contact messages using the backend actor with validation and diagnostics.",
  "frontend/src/index.css": "Sets global Tailwind styles, fonts, color variables, and motion preferences for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPanel.tsx": "Renders an about panel describing the cafe's mission, community, and location in a sliding sheet UI.",
  "frontend/src/pages/ContactPanel.tsx": "Provides a contact form with validation and submission plus displays alternate contact options.",
  "frontend/src/pages/ExportPanel.tsx": "Displays download options and installation instructions for exporting the site as a WordPress‑ready static package.",
  "frontend/src/pages/MenuPanel.tsx": "Renders a slide-in menu panel with tabbed categories and a list of menu items. Includes a MenuItem component for displaying item details.",
  "frontend/src/scene/CafeScene.tsx": "Sets up the 3D cafe scene with lighting, physics, environment, navigation controls, and interactions. Wraps content in Suspense and optionally disables OrbitControls when navigating.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Implements first-person navigation using keyboard and mouse with pointer lock. Updates camera movement, rotation, and boundary constraints each frame.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Builds the physical cafe environment including floor, walls, furniture, decor, and physics floor plane. Imports and places multiple detailed furniture components.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Defines reusable 3D furniture components like counters, tables, chairs, and stools using basic geometries and textures. Each component returns grouped meshes with materials and positions.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds decorative props such as an espresso machine, grinder, pastry case, cups, and wall menu. Uses simple meshes to dress the scene with small details.",
  "frontend/src/scene/interactions/DoorController.tsx": "Controls an auto-opening door that rotates based on camera distance. Smoothly animates door rotation each frame.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Creates an interactive prop the user can drag to rotate, highlighting when active. Displays an HTML hint overlay while inspecting.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Aggregates all scene interactions including POIs, proximity zones, door control, inspectables, and panel triggers. Passes the camera and activation callbacks to child interaction components.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Displays floating interactive 3D props like cards, cups, or signs with hover/press animations. Clicking triggers a provided callback and shows a label via 3D text.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Renders interactive 3D POI markers with hover and dwell-based activation tied to camera gaze. Handles scaling, highlighting, and triggering UI panels through poiRegistry.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Contains a registry of POIs with positions, labels, actions, and highlight colors. Used by POIMarkers to render and activate POI interactions.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Defines proximity-based trigger zones that react when the camera enters them. Shows an on-screen prompt to activate a related UI panel.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Places several PanelProp objects in the scene for menu, about, and contact interactions. Each prop triggers its corresponding panel on click.",
  "frontend/src/scene/materials/contourStyle.ts": "Provides helper functions to create styled Three.js materials like contour, wood, and metal. Exports a set of predefined contour color tokens.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store managing which UI panel is active. Exposes setter for updating the active panel type.",
  "frontend/src/theme/motion.ts": "Defines timing, easing, and spring presets for motion animations. Includes a utility to generate CSS transition strings.",
  "frontend/src/theme/tokens.ts": "Exports design tokens for colors, typography, spacing, and radii. Used to maintain consistent theme styling across the app.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Provides error logging utilities with remediation hints for deployment and actor issues. Includes helpers to classify type-mismatch and actor-initialization errors.",
  "frontend/tailwind.config.js": "Tailwind configuration defining color variables, fonts, animations, and plugins. Extends theme with custom design tokens and container settings.",
  "project_state.json": "Defines the current project state for an interactive 3D cafe site, outlining features, architectural notes, and known deployment issues. Contains metadata and a list of implemented features for planning and tracking."
}