{
  "backend/main.mo": "Stores contact messages in a Motoko canister and provides methods to submit and retrieve them.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of various frontend source files.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Documentation outlining the backend–frontend–runtime deployment flow and diagnostic guidelines.",
  "frontend/index.css": "Global Tailwind CSS config defining color tokens, dark mode variables, and base styling.",
  "frontend/index.html": "Base HTML file bootstrapping the React application via main.tsx.",
  "frontend/public/elementor/README-elementor.txt": "Instructions for embedding the static 3D cafe build into WordPress Elementor and its capabilities.",
  "frontend/src/App.tsx": "Main React app wiring 3D scene, overlay panels, top navigation, theming, and deployment error handling.",
  "frontend/src/components/layout/ContourFrame.tsx": "Layout wrapper providing a textured, blurred, framed container for UI elements.",
  "frontend/src/components/layout/PanelSurface.tsx": "Generic panel container with header, close button, and scrollable content inside a framed surface.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip for reopening the onboarding overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar with logo, seating layout toggle, and buttons to open primary panels.",
  "frontend/src/components/overlays/DeploymentStartupErrorOverlay.tsx": "Displays a modal for deployment or startup errors with summaries, technical details, and diagnostics copy support.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "Provides a dialog explaining movement and interaction instructions for first‑time users.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useActorWithErrorHandling.ts": "Enhanced actor hook that logs errors, exposes error state, and supports manual retry attempts.",
  "frontend/src/hooks/useAppViewport.ts": "Tracks visual viewport height and sets a CSS variable to prevent layout shifts on mobile.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Manages a localStorage‑based flag to determine and dismiss first‑visit onboarding.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for Internet Identity login, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for fetching and submitting contact messages with diagnostics and validation.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme CSS variables for light/dark modes, safe-area utilities, and base layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts App.",
  "frontend/src/pages/AboutPanel.tsx": "Implements a side sheet showing static information about the cafe with icons and styled sections.",
  "frontend/src/pages/ContactPanel.tsx": "Renders a contact form with validation and backend submission plus a messages section.",
  "frontend/src/pages/ExportPanel.tsx": "Provides WordPress export instructions and a download link for a static package.",
  "frontend/src/pages/MenuPanel.tsx": "Displays menu categories using tabs and lists items with prices and descriptions.",
  "frontend/src/scene/CafeScene.tsx": "Sets up the 3D cafe scene with basic lighting, fallback room, navigation, and render/error callbacks.",
  "frontend/src/scene/CanvasMountErrorBoundary.tsx": "Error boundary that captures and reports mount-time WebGL canvas errors.",
  "frontend/src/scene/characters/CafeCharacters.tsx": "Deprecated aggregator component that now mounts no characters.",
  "frontend/src/scene/characters/CafeDogs.tsx": "Places two static dog characters in predefined cafe positions.",
  "frontend/src/scene/characters/CafeHumans.tsx": "Places three static human characters with fixed poses and colors in the cafe scene.",
  "frontend/src/scene/characters/characterMaterials.ts": "Defines color palettes and memoized material helpers for characters to reduce allocations.",
  "frontend/src/scene/characters/DogCharacter.tsx": "Builds a static low‑poly dog using simple geometries and shared materials.",
  "frontend/src/scene/characters/HumanCharacter.tsx": "Builds a static low‑poly human with configurable colors and seated/standing poses.",
  "frontend/src/scene/components/MenuBoardFrameGlow.tsx": "Renders a neon-style emissive frame outline using a ShapeGeometry border.",
  "frontend/src/scene/components/NeonCanvasLabel.tsx": "Generates a canvas-based neon‑glow text texture for use on a plane mesh.",
  "frontend/src/scene/components/WallFrameLabel.tsx": "Creates a high‑resolution canvas text texture for wall-mounted labels with padding and surface offset.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "React hook adding keyboard and pointer-based first-person navigation with touch detection and pointer lock support.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "Fallback 3D café room rendering walls, floor, counter, and minimal props with contour textures and conditional seating.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Full café environment with physics floor, textured walls, contour overlays, furniture, and optional seating based on layout.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Defines reusable 3D furniture components including counter, table, and wooden chair with contour-textured surfaces.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds decorative café props like espresso machine, grinder, pastry case, and neon-accented menu board with contour textures.",
  "frontend/src/scene/environment/CommercialEspressoMachine.tsx": "Renders a detailed commercial espresso machine model using Three.js meshes, including group heads, steam wands, and drip tray.",
  "frontend/src/scene/HomeCafeCanvas.tsx": "Manages WebGL checks, error handling, loading state, and mounts the 3D cafe scene with fallback overlays.",
  "frontend/src/scene/hooks/useContourTexture.ts": "Loads and configures a contour texture and creates floor, wall, and furniture variants with repeat and filtering settings.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "Asynchronously loads a texture without blocking rendering and logs success or failure with optional error callbacks.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Provides a watchdog timer that triggers a callback if a scene fails to render within a timeout, with reset and cancel support.",
  "frontend/src/scene/hooks/useWallMapTexture.ts": "Loads and configures a wall map texture with repeat, filtering, and anisotropy settings for crisp rendering.",
  "frontend/src/scene/interactions/DoorController.tsx": "Controls a door mesh that opens or closes based on the camera’s distance, animating rotation smoothly.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Implements an inspectable prop that rotates on drag and shows an HTML hint while inspecting.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Empty placeholder file for interaction-related logic.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Renders interactive floating props (card, cup, sign) with hover scaling, click feedback, and optional label text.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Displays rotating POI markers with hover and dwell detection, triggering UI panel activation when looked at or clicked.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Defines a registry of POIs with positions, labels, actions, and highlight colors for use in interaction components.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Detects when the camera enters defined proximity zones and shows an overlay with an action button for each zone.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Empty placeholder file for scene panel prop logic.",
  "frontend/src/scene/materials/contourStyle.ts": "Defines factory functions for creating various Three.js materials and exports preset contour color values.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "React error boundary that tracks render errors and resets on retry via resetKey.",
  "frontend/src/scene/ui/NonWebGLFallback.tsx": "Displays a non-blocking UI fallback when WebGL is unavailable, including layout info, technical details, and a re-check button.",
  "frontend/src/scene/ui/SceneDegradedOverlay.tsx": "Shows an overlay warning that only a basic room loaded and offers a retry option.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "Presents a detailed error overlay for scene load failures with optional diagnostics and retry support.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "Displays a loading overlay that switches to a degraded warning after a timeout and can trigger retries.",
  "frontend/src/scene/ui/WebGLCheckingOverlay.tsx": "Shows a minimal overlay indicating that WebGL support is being checked.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Implements diagnostic logging utilities, types, and helpers for scene load failures and statuses.",
  "frontend/src/scene/utils/webglFailureHeuristics.ts": "Provides heuristics to classify WebGL-related errors and generate readable fallback reasons.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL support, determines context version, and reports issues or warnings.",
  "frontend/src/state/roomLayoutStore.ts": "Zustand store managing the current room layout variant and toggling between variants.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store for tracking which UI panel is active.",
  "frontend/src/theme/motion.ts": "Defines motion timing, easing presets, and a helper to build transition strings.",
  "frontend/src/theme/tokens.ts": "Exports design tokens for colors, typography, spacing, and radii used throughout the UI.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Provides utilities for logging deployment errors with contextual details and remediation hints across backend, frontend, and runtime steps.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Stores project metadata, existing features, pending requests, and state information for the Contour Cafe 3D project."
}