{
  "backend/main.mo": "Defines a canister that stores contact messages, allows submitting them with validation, and exposes a query to retrieve all messages.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, tests, and confidence ratings.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of numerous frontend files, including scene, UI, hooks, and interaction modules.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment checklist outlining steps and diagnostics for backend and frontend deployment flow.",
  "frontend/index.css": "Global Tailwind CSS styles defining light/dark theme variables and base styling for the app.",
  "frontend/index.html": "Base HTML entry file that loads the React application via main.tsx.",
  "frontend/public/elementor/README-elementor.txt": "Instructions for embedding the static 3D cafe experience into WordPress via Elementor, including installation and backend notes.",
  "frontend/src/App.tsx": "Main React app wiring together the 3D scene, overlays, startup watchdog, diagnostics, navigation, and error handling.",
  "frontend/src/components/layout/ContourFrame.tsx": "Reusable framed container with contour texture background and visual styling for panels.",
  "frontend/src/components/layout/PanelSurface.tsx": "Panel layout component providing a framed surface with header, close button, and scrollable content area.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip that triggers the onboarding/controls overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar with logo and buttons to open menu, about, contact, and export panels.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "Renders a modal onboarding overlay explaining 3D navigation, interactions, and tips, with a button to close and start exploring.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates related queries when the actor changes.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Tracks whether the user is visiting for the first time using localStorage and exposes functions to dismiss onboarding.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, managing identity loading, login, logout, and status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and submitting contact messages through the backend actor with validation and diagnostics.",
  "frontend/src/index.css": "Sets global Tailwind styles, custom color variables, typography, and reduced-motion rules for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AboutPanel.tsx": "Displays an informational side panel describing the cafe’s mission, values, and location details.",
  "frontend/src/pages/ContactPanel.tsx": "Provides a contact form panel that submits messages and lists alternative contact methods using React Query and UI components.",
  "frontend/src/pages/ExportPanel.tsx": "UI panel that provides a WordPress download link, warnings, and installation instructions for embedding the static 3D cafe experience.",
  "frontend/src/pages/MenuPanel.tsx": "Side panel showing a tabbed cafe menu with categorized items and prices using UI tabs and custom MenuItem components.",
  "frontend/src/scene/CafeScene.tsx": "Main 3D scene setup combining fallback geometry, environment loading, physics, and interactions with error handling.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Custom hook enabling first-person camera movement with keyboard, pointer lock, and drag-to-look controls.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "Simple always-available fallback room geometry providing basic walls and floor without async dependencies.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Full cafe environment with physics floor, textured surfaces, furniture, and decorative props loaded into the main scene.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Defines reusable 3D furniture components including a counter, cafe table, wooden chair, and bar stool using Three.js meshes and textures.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds decorative cafe scene elements such as an espresso machine, grinder, pastry case, cup stack, and wall menu with loaded textures.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "React hook that loads a texture asynchronously with error handling and returns undefined on failure.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Provides a watchdog timer that triggers a callback if a scene fails to render within a timeout, with a cancel method.",
  "frontend/src/scene/interactions/DoorController.tsx": "Controls an automatic door that opens when the camera approaches and smoothly animates its rotation.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Interactive prop allowing click-and-drag rotation with visual feedback and an on-screen hint.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Aggregates all scene interaction components including POIs, proximity zones, door control, inspectable items, and panel triggers.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Displays an interactive floating prop (card, cup, or sign) with hover, press animation, and a label.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Renders rotating POI markers that react to hover and dwell, triggering UI panels when looked at.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Defines a list of points of interest with positions, labels, actions, and highlight colors for in‑scene interactions.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Detects when the camera enters defined zones and shows a UI prompt to trigger related actions.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Renders clickable 3D props (menu, about, contact) that trigger onActivate with a selected panel type.",
  "frontend/src/scene/materials/contourStyle.ts": "Provides factory functions for Three.js materials (contour, wood, metal) and a shared color palette.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "React error boundary that catches scene render errors and exposes callbacks for reporting and reset.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "Displays an error overlay for scene load failures with optional diagnostic details and a retry action.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "Shows a loading overlay with a spinner and status text while the 3D scene initializes.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Implements scene diagnostic logging, error classification, and utilities for formatting failure stages.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL support and required extensions, returning a success flag and failure reason.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store managing which UI panel (menu, about, contact, export) is currently active.",
  "frontend/src/theme/motion.ts": "Defines motion easing, durations, spring presets, and a helper to generate CSS transitions.",
  "frontend/src/theme/tokens.ts": "Exports design tokens for colors, typography, spacing, and radii used across the app.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Provides standardized deployment error logging, remediation hints, diagnostic wrappers, and error-type checks.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins for the project.",
  "project_state.json": "Tracks project state, features, issues, and architectural notes for the interactive 3D café build."
}