{
  "backend/main.mo": "Motoko canister storing contact messages with validation and query/submit methods.",
  "feature_evidence.json": "Feature evidence report mapping 3D character features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-style list of frontend file descriptions summarizing their roles in the app and 3D scene.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment checklist outlining backend deploy, frontend build, runtime steps, and diagnostics format.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light/dark theme tokens applied globally.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main TypeScript bundle.",
  "frontend/public/elementor/README-elementor.txt": "Guide for embedding the static 3D cafe build into WordPress Elementor with setup steps and limitations.",
  "frontend/src/App.tsx": "Root React component combining the 3D scene, top navigation, overlay panels, and theme provider.",
  "frontend/src/components/layout/ContourFrame.tsx": "Frame component applying contour texture, background styling, and visual container for panels.",
  "frontend/src/components/layout/PanelSurface.tsx": "Reusable panel layout with header, close button, scroll area, and contour styling wrapper.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip that triggers reopening the onboarding overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar with logo and buttons to open About, Contact, and Menu panels.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "Dialog overlay showing first-visit movement, interaction instructions, and tips.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAppViewport.ts": "Tracks visual viewport height and updates a CSS variable to stabilize mobile layout.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Manages a localStorage-based flag for detecting and dismissing first-visit onboarding.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for loading, storing, and managing Internet Identity authentication with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and submitting contact messages using the backend actor with validation and diagnostics.",
  "frontend/src/index.css": "Global styles including Tailwind layers, color variables, viewport handling, and safe-area support.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPanel.tsx": "UI panel component displaying informational content about Contour Cafe using Sheet and ScrollArea components.",
  "frontend/src/pages/ContactPanel.tsx": "Implements a contact form panel with fields, validation, message submission, and message list loading.",
  "frontend/src/pages/ExportPanel.tsx": "Provides a panel for downloading a static WordPress package and displays related instructions and limitations.",
  "frontend/src/pages/MenuPanel.tsx": "Renders a navigable menu UI with tabs for coffee, pastries, and desserts, and supports panel navigation.",
  "frontend/src/scene/CafeScene.tsx": "Sets up the cafe 3D scene with basic lighting, fallback room, navigation, and error handling hooks.",
  "frontend/src/scene/characters/CafeCharacters.tsx": "Aggregates all character groups, mounting humans and dogs in one component.",
  "frontend/src/scene/characters/CafeDogs.tsx": "Places two dog characters in predefined cafe positions with specific rotations and styling.",
  "frontend/src/scene/characters/CafeHumans.tsx": "Places seated, waiting, and walking human characters, including a looped walking path.",
  "frontend/src/scene/characters/characterMaterials.ts": "Provides shared character material hooks and color palettes for skin, clothing, and dog fur using MeshStandardMaterial.",
  "frontend/src/scene/characters/DogCharacter.tsx": "Defines a lightweight animated dog using simple meshes with idle motions like tail wag, head bob, and breathing.",
  "frontend/src/scene/characters/HumanCharacter.tsx": "Creates a low‑poly human with optional walking or seated animations, using shared materials and simple primitive geometry.",
  "frontend/src/scene/components/MenuBoardFrameGlow.tsx": "Renders a neon emissive rectangular frame outline using a shape geometry to create a glowing edge effect.",
  "frontend/src/scene/components/WallFrameLabel.tsx": "Generates a high‑resolution canvas texture for crisp text labels on planes, supporting padding and transparent backgrounds.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Implements keyboard and pointer-based first‑person navigation with touch support, drag‑to‑look, and optional pointer lock.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "Builds a minimal always‑loaded cafe room with walls, floor, contour overlays, furniture, and characters to guarantee visible 3D content.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Composes the full café scene with floor, ceiling, walls, furniture, textures, and mount lifecycle signaling.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Defines reusable 3D café furniture components including counter, table, and wooden chair with contour-textured materials.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds decorative props such as espresso machine, grinder, pastry case, and menu board with neon glow and label text.",
  "frontend/src/scene/environment/CommercialEspressoMachine.tsx": "Implements a detailed commercial espresso machine model with group heads, controls, steam wands, and metallic materials.",
  "frontend/src/scene/HomeCafeCanvas.tsx": "Manages the Three.js canvas lifecycle, loading state, WebGL checks, error overlays, and mounts the CafeScene.",
  "frontend/src/scene/hooks/useContourTexture.ts": "Loads and configures a contour texture and produces floor, wall, and furniture variants with repeat and filtering settings.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "Asynchronously loads textures without blocking render and reports success or failure through diagnostics callbacks.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Provides a watchdog timer that triggers a timeout callback if a scene fails to render within a set duration.",
  "frontend/src/scene/hooks/useWallMapTexture.ts": "Loads and configures the green wall-map texture with wrapping, repeat, and anisotropic filtering settings.",
  "frontend/src/scene/interactions/DoorController.tsx": "Controls a door that automatically opens or closes based on camera proximity using per-frame updates.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Interactive mesh that can be dragged to rotate and shows an HTML tooltip while inspecting.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Empty file placeholder for interaction management.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Floating interactive prop (card, cup, or sign) with hover/press feedback and optional 3D label.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Displays rotating POI markers with hover, dwell detection, and activation callbacks.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Registry defining POI IDs, labels, positions, actions, and highlight colors.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Detects when the camera enters predefined zones and shows an activation overlay.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Empty file placeholder for panel-related scene props.",
  "frontend/src/scene/materials/contourStyle.ts": "Helpers for creating styled mesh materials including contour, wood, metal, and overlay materials.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "Error boundary that catches scene render errors and signals resets via a resetKey.",
  "frontend/src/scene/ui/SceneDegradedOverlay.tsx": "Overlay shown when only the basic scene loads, offering a retry button.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "Error overlay with diagnostic details and retry option for failed scene loads.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "Loading overlay with fallback degraded message and retry option after delay.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Diagnostics utilities for logging scene failures, successes, and formatting diagnostic stages.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL availability and required extensions, returning support status and reason on failure.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store managing which UI overlay panel is active.",
  "frontend/src/theme/motion.ts": "Defines motion timing, easing, and spring presets and provides a helper to build CSS transitions.",
  "frontend/src/theme/tokens.ts": "Theme tokens for colors, typography, spacing, and radii using OKLCH color values.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Utility for logging structured deployment errors with step labels and remediation hints.",
  "frontend/tailwind.config.js": "Tailwind configuration with extended colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata describing features, requests, issues, and current state for Contour Cafe."
}