{
  "backend/main.mo": "Motoko canister storing contact messages with submit and query methods, validating name input before appending to a var array.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs for deployment and interface validation.",
  "frontend-file-summaries.txt": "Collection of short descriptions summarizing key frontend files including components, hooks, scenes, and UI systems.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Checklist describing the backend deploy, frontend build, and runtime steps along with diagnostic formats for troubleshooting.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark mode design tokens and base styles for the application.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx as the module script.",
  "frontend/public/elementor/README-elementor.txt": "Guide for embedding the static 3D cafe build into WordPress Elementor with setup steps, features, limitations, and customization notes.",
  "frontend/src/App.tsx": "Main React app combining the 3D scene with UI overlays, top navigation, and panel routing controlled via Zustand state.",
  "frontend/src/components/layout/ContourFrame.tsx": "Layout wrapper applying textured background, rounded borders, and blurred frame styling for panel surfaces.",
  "frontend/src/components/layout/PanelSurface.tsx": "Generic panel container with title bar, close button, scrollable content area, and adaptive height handling.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip that triggers the onboarding or control overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar showing branding and buttons that open About, Contact, and Menu panels.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "A dialog overlay that introduces users to interaction controls and tips for exploring the 3D cafe.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating queries when it changes.",
  "frontend/src/hooks/useAppViewport.ts": "Sets a CSS variable for stable viewport height using visualViewport events to handle mobile browser chrome changes.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Tracks whether the user has dismissed onboarding using localStorage and provides a dismiss handler.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and submitting contact messages with runtime validation and diagnostics.",
  "frontend/src/index.css": "Global styles using Tailwind with a custom color palette, viewport handling, typography, and safe-area utilities.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClient and InternetIdentityProvider before rendering the main App component.",
  "frontend/src/pages/AboutPanel.tsx": "A right-side sheet panel displaying information about Contour Cafe with scrollable content and UI sections.",
  "frontend/src/pages/ContactPanel.tsx": "Implements a slide-in contact form panel with input fields and submission via custom hooks, plus a messages section. Handles validation, loading states, and success/error toasts.",
  "frontend/src/pages/ExportPanel.tsx": "Provides a panel for downloading a static WordPress-compatible package, including instructions, feature notes, and a download link.",
  "frontend/src/pages/MenuPanel.tsx": "Renders a multi-tab menu panel with categories and items, and supports navigation to other panels via callbacks.",
  "frontend/src/scene/CafeScene.tsx": "Defines the core 3D cafe scene with basic lighting, a fallback room, navigation hooks, and error/ready event handling. Full environment loading is disabled in room-first mode.",
  "frontend/src/scene/components/MenuBoardFrameGlow.tsx": "Creates a neon-style glowing frame mesh using shape geometry and emissive materials for decorative UI elements.",
  "frontend/src/scene/components/WallFrameLabel.tsx": "Generates a high-resolution canvas texture for crisp text and maps it onto a 3D plane for use as wall labels or signs.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Hook implementing keyboard and pointer-based camera navigation with touch detection, drag-to-look, and pointer lock support.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "Fallback 3D cafe room rendering simple floors, walls, lighting, and basic furniture with contour textures and labels.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Full cafe environment with physics floor, textured walls, detailed furniture, ceiling overlays, and mount diagnostics.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Defines Counter, CafeTable, and WoodenChair components with contour-textured surfaces and basic geometry construction.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds scene props like espresso machine, grinder, pastry case, and menu board with contour textures and neon glow.",
  "frontend/src/scene/environment/CommercialEspressoMachine.tsx": "Defines a detailed commercial espresso machine 3D model composed of meshes, group heads, steam wands, and a drip tray.",
  "frontend/src/scene/HomeCafeCanvas.tsx": "Sets up the main three.js canvas, manages loading and error states, handles WebGL support, and renders the CafeScene inside an error boundary.",
  "frontend/src/scene/hooks/useContourTexture.ts": "Loads and configures a contour texture and creates floor, wall, and furniture variants with adjusted repeat and filtering.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "Asynchronously loads a texture with logging and optional error callback, returning undefined on failure.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Watchdog hook that triggers a timeout callback if a scene doesn't render in time and provides a cancel method.",
  "frontend/src/scene/hooks/useWallMapTexture.ts": "Loads and configures a repeating green wall map texture with filtering and anisotropy settings.",
  "frontend/src/scene/interactions/DoorController.tsx": "Animates a door opening and closing based on the camera's proximity using smooth rotation updates.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Provides a draggable, rotatable prop with visual feedback and an on-screen hint when inspecting.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Empty placeholder file for interaction management.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Displays interactive floating props (card, cup, or sign) with hover, press feedback, and label text.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Renders rotating POI markers with hover and dwell activation logic tied to camera direction and distance.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Defines a registry of POIs with positions, labels, actions, and highlight colors for interaction components.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Detects when the camera enters predefined zones and shows an overlay to trigger related actions.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Empty placeholder file for scene panel props.",
  "frontend/src/scene/materials/contourStyle.ts": "Defines factory functions for Three.js materials (contour, wood, metal, overlay) and exports preset contour colors.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "A React error boundary that captures scene render errors and signals the parent while resetting on retry.",
  "frontend/src/scene/ui/SceneDegradedOverlay.tsx": "Renders an overlay informing users that only the basic room loaded and provides a retry button.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "Displays an error overlay for failed scene loads with optional diagnostic details and a retry action.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "Shows a loading screen for the scene and switches to a degraded-state overlay after a timeout.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Provides types and functions for logging scene load failures, successes, and formatting diagnostic stages.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL support and required extensions, returning a support status and reason.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store managing which UI overlay panel is active.",
  "frontend/src/theme/motion.ts": "Defines motion easing, durations, spring presets, and a helper to generate transition strings.",
  "frontend/src/theme/tokens.ts": "Exports design tokens including colors, typography, spacing, and radii for theming.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Logs deployment-related errors with contextual details and remediation hints.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radii, animations, and plugins for the project.",
  "project_state.json": "Defines project metadata, known deployment issues, and existing feature requirements for build, diagnostics, and interface validation."
}