{
  "backend/main.mo": "Stores contact messages in a growable array and provides methods to submit and retrieve them.",
  "feature_evidence.json": "Feature evidence report describing two environment updates and their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated summaries of multiple frontend files describing UI panels, hooks, 3D scene components, and interaction systems.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment guide outlining backend, frontend, and runtime steps along with diagnostic output format.",
  "frontend/index.css": "Tailwind setup defining light and dark theme CSS variables and base styling rules.",
  "frontend/index.html": "HTML entry point linking to the root element and loading the main frontend script.",
  "frontend/public/elementor/README-elementor.txt": "Instructions for embedding the static 3D cafe build into WordPress via Elementor, including capabilities and limitations.",
  "frontend/src/App.tsx": "Main React app initializing theme, 3D scene, top nav, overlay panels, and startup error handling.",
  "frontend/src/components/layout/ContourFrame.tsx": "Container component rendering children inside a styled contour-textured frame.",
  "frontend/src/components/layout/PanelSurface.tsx": "Generic panel layout with title bar, close button, scrollable content, and contour frame styling.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip that triggers the onboarding or help overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar with logo and buttons to open About, Contact, and Menu panels.",
  "frontend/src/components/overlays/DeploymentStartupErrorOverlay.tsx": "Overlay component showing a startup error summary with expandable technical details and copy‑to‑clipboard diagnostics.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "Dialog-based onboarding overlay explaining movement and interaction controls with tips for navigating the 3D cafe.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useActorWithErrorHandling.ts": "Enhanced actor hook that adds error tracking, logs diagnostics, and supports manual retries on actor initialization failures.",
  "frontend/src/hooks/useAppViewport.ts": "Hook that updates a CSS variable with the visual viewport height to stabilize layouts on mobile browsers.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Hook managing a localStorage-backed flag to determine and update whether the user is visiting for the first time.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login state, storing identities, and exposing login/clear actions.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching and submitting contact messages using the backend actor with diagnostics, validation, and query invalidation.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables for light/dark themes, typography, viewport behavior, and safe‑area utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPanel.tsx": "Implements a slide‑in About panel describing the cafe with icons, sections, and scrollable content.",
  "frontend/src/pages/ContactPanel.tsx": "Provides a contact form panel with validation, backend submission via queries, and contact info display.",
  "frontend/src/pages/ExportPanel.tsx": "Shows a panel for downloading a static WordPress package with instructions and feature notes.",
  "frontend/src/pages/MenuPanel.tsx": "Renders a tabbed menu panel for coffee, pastries, and desserts, with navigation to other panels.",
  "frontend/src/scene/CafeScene.tsx": "Defines the 3D cafe scene with lights, a basic fallback room, navigation hooks, and render‑ready/error callbacks.",
  "frontend/src/scene/characters/CafeCharacters.tsx": "Stub aggregator that returns null so no characters are added to the scene.",
  "frontend/src/scene/characters/CafeDogs.tsx": "Places two static DogCharacter instances in fixed positions within the cafe scene.",
  "frontend/src/scene/characters/CafeHumans.tsx": "Places three static HumanCharacter instances with fixed positions, rotations, and color settings.",
  "frontend/src/scene/characters/characterMaterials.ts": "Provides shared material hooks and predefined color palettes for skin, clothing, and fur to reduce allocations.",
  "frontend/src/scene/characters/DogCharacter.tsx": "Defines a static low-poly dog model built from simple primitives with shared materials and no animations.",
  "frontend/src/scene/characters/HumanCharacter.tsx": "Defines a static low-poly human model using shared materials, supporting seated or standing poses.",
  "frontend/src/scene/components/MenuBoardFrameGlow.tsx": "Creates a glowing emissive frame outline using shape geometry for neon-style rectangular borders.",
  "frontend/src/scene/components/WallFrameLabel.tsx": "Generates a high‑resolution canvas texture to render crisp 3D text labels on a plane with minimal z‑fighting.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Provides camera navigation with keyboard controls, pointer lock rotation, and touch-friendly drag-to-look behavior. Manages input events and updates camera orientation and movement each frame.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "Renders a lightweight fallback café room with walls, floor, contour overlays, and basic furniture including counter, espresso machine, and tables. Designed to show reliable geometry without dependencies or suspense.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Builds the full café environment including physics floor, textured walls, ceiling contour overlays, and arranged furniture. Signals successful mount and applies contour textures to surfaces.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Defines reusable 3D furniture components such as counter, table, and wooden chair with contour-textured beige surfaces. Each component constructs its geometry and materials for café scene placement.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds espresso machine, grinder, pastry case, and a neon-glow menu board with large label text to the café environment. Applies beige contour textures and preserves glass/metal materials where appropriate.",
  "frontend/src/scene/environment/CommercialEspressoMachine.tsx": "Renders a detailed commercial espresso machine model using multiple meshes and groups. Supports positioning and optional contour texture.",
  "frontend/src/scene/HomeCafeCanvas.tsx": "Sets up the main Three.js canvas with loading/error handling, WebGL checks, and responsive camera settings, mounting the CafeScene inside an error boundary.",
  "frontend/src/scene/hooks/useContourTexture.ts": "Loads a contour texture and creates floor, wall, and furniture variants with repeat and filtering settings.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "Non-blocking texture loader hook that logs success or failure and returns a loaded texture or undefined.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Watchdog hook that triggers a timeout callback if a scene fails to render within a set duration.",
  "frontend/src/scene/hooks/useWallMapTexture.ts": "Loads and configures a repeating wall-map texture with filtering and anisotropy settings.",
  "frontend/src/scene/interactions/DoorController.tsx": "Automatically opens and closes a door mesh based on camera proximity using smooth rotation.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Provides a draggable inspectable prop that rotates during inspection and shows an on-screen hint.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Empty placeholder file for interaction management.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Renders interactive floating props (card, cup, sign) with hover/press feedback and labels.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Displays rotating, interactive POI markers with hover, dwell detection, and activation callbacks.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Defines the list of POIs with IDs, labels, positions, actions, and optional highlight colors.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Defines proximity-triggered UI zones that activate when the camera enters specific areas.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Empty placeholder file for panel-related scene props.",
  "frontend/src/scene/materials/contourStyle.ts": "Defines helper functions to create various Three.js materials and exports a contour color palette.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "React error boundary that captures scene render errors, increments a counter, and resets when a retry key changes.",
  "frontend/src/scene/ui/SceneDegradedOverlay.tsx": "Displays a UI overlay warning when the café details fail to load and provides a retry button.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "Renders an error overlay for scene load failures with optional technical diagnostics and a retry action.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "Shows a loading overlay for the scene and switches to a degraded warning state after a timeout.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Provides types and functions for logging, formatting, and reporting scene loading diagnostics.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL support and required extensions, returning diagnostic information.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store managing which UI overlay panel is currently active.",
  "frontend/src/theme/motion.ts": "Defines motion easing, durations, spring configs, and a helper for building CSS transitions.",
  "frontend/src/theme/tokens.ts": "Exports design tokens for colors, typography, spacing, and radii.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Provides utilities for logging deployment errors with context and remediation hints.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and plugin setup.",
  "project_state.json": "Describes project state, features, requests, and metadata for the 3D Cafe project."
}