{
  "backend/main.mo": "Motoko actor storing contact messages in a growable array with functions to submit and retrieve them.",
  "feature_evidence.json": "Feature evidence report listing two scene-labeling features with their related files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing many frontend files, their roles, and functionality across the app.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment checklist outlining backend deploy, frontend build, and runtime validation steps plus diagnostic format.",
  "frontend/index.css": "Global Tailwind CSS setup defining color tokens, themes, and base styles for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/elementor/README-elementor.txt": "Guide for embedding the static 3D café build into WordPress via Elementor, including installation, features, and limitations.",
  "frontend/src/App.tsx": "Main React app wiring viewport setup, 3D scene canvas, top navigation, and menu panel overlay.",
  "frontend/src/components/layout/ContourFrame.tsx": "Reusable styled container adding contour texture background and rounded framed layout.",
  "frontend/src/components/layout/PanelSurface.tsx": "Panel wrapper providing title bar, close button, scrollable content area, and contour frame styling.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip that triggers the onboarding overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar showing logo and a menu button that opens the menu panel.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "Dialog explaining movement, gaze, proximity, and interaction tips for first‑time users.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing an authenticated or anonymous backend actor and refreshing dependent queries.",
  "frontend/src/hooks/useAppViewport.ts": "Tracks visual viewport height and updates a CSS variable to stabilize mobile layout against browser chrome changes.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Manages a first‑visit flag using localStorage and provides functions to dismiss or show onboarding.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for Internet Identity authentication with login, logout, and status handling using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and submitting contact messages with validation and diagnostics.",
  "frontend/src/index.css": "Global styles configuring Tailwind layers, color variables, viewport behavior, safe areas, and base typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AboutPanel.tsx": "A right‑side sheet panel showing informational content about the cafe with icons and styled sections.",
  "frontend/src/pages/ContactPanel.tsx": "A right‑side panel with a contact form that submits messages and displays contact info using React Query and UI components.",
  "frontend/src/pages/ExportPanel.tsx": "A right-side sheet panel offering a downloadable WordPress static package with instructions and feature notes.",
  "frontend/src/pages/MenuPanel.tsx": "A tabbed menu panel displaying coffee, pastry, and dessert items using a right-side sheet UI.",
  "frontend/src/scene/CafeScene.tsx": "Defines the 3D cafe scene with lighting, a basic room fallback, navigation, and error handling hooks.",
  "frontend/src/scene/components/WallFrameLabel.tsx": "Renders 3D text on a plane using a canvas-generated texture with customizable size and styling.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Implements keyboard and pointer-based first-person navigation with touch support and pointer lock integration.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "Provides a minimal fallback café scene with simple floor, walls, ceiling, furniture, contour overlays, and an espresso machine to ensure immediate rendering.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Defines the full café environment with physics floor, textured walls, contour‑styled ceiling, furniture arrangement, and mount logging.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Implements reusable 3D café furniture components including a counter, table, and wooden chair with optional contour textures.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds countertop props, espresso machine, pastry case, napkin holder, and menu board with contour‑textured elements.",
  "frontend/src/scene/environment/CommercialEspressoMachine.tsx": "Renders a detailed commercial espresso machine model with group heads, steam wands, and metal materials.",
  "frontend/src/scene/HomeCafeCanvas.tsx": "Wraps the Three.js canvas with loading, error handling, WebGL checks, and responsive camera settings.",
  "frontend/src/scene/hooks/useContourTexture.ts": "Loads a high‑contrast contour texture and generates configured variants for floors, walls, and furniture.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "Loads textures asynchronously without blocking rendering, reporting success or failure through diagnostics.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Hook that triggers a timeout callback if a scene doesn't render in time and provides a cancel method upon successful render.",
  "frontend/src/scene/hooks/useWallMapTexture.ts": "Loads and configures a repeating wall map texture with filtering and anisotropy settings.",
  "frontend/src/scene/interactions/DoorController.tsx": "Animates a door opening based on camera proximity and smoothly interpolates rotation each frame.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Interactive prop that can be clicked and dragged to rotate, showing a tooltip while inspecting.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Empty placeholder file for interaction management.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Floating interactive prop with hover/press feedback and multiple visual variants such as card, cup, or sign.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Displays point‑of‑interest markers with hover, dwell detection, and activation actions tied to camera direction.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Registry of POIs defining id, label, position, action, and highlight color.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Detects when the camera enters predefined zones and shows an overlay with an action button.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Empty placeholder for scene panel props.",
  "frontend/src/scene/materials/contourStyle.ts": "Exports helpers to create contour, wood, metal, and overlay materials plus contour color constants.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "A React error boundary that captures scene render errors and resets on retry.",
  "frontend/src/scene/ui/SceneDegradedOverlay.tsx": "Overlay UI shown when full scene fails to load, offering a retry option and explanation.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "Error overlay displaying failure details, optional diagnostics, and a retry button.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "React overlay showing a loading spinner and, after a delay, a degraded state with retry support.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Utilities for logging scene loading/rendering failures and successes with labeled diagnostic stages.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL availability and required extensions, returning support status and reason.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store tracking which UI overlay panel is active.",
  "frontend/src/theme/motion.ts": "Defines easing, durations, and spring presets plus a helper for building transition strings.",
  "frontend/src/theme/tokens.ts": "Centralized design tokens for colors, typography, spacing, and radii.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Standardized deployment error logger providing context and remediation hints for build/runtime issues.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and plugins for the project.",
  "project_state.json": "Metadata describing project state, features, and pending requests."
}