{
  "backend/main.mo": "Motoko canister storing contact messages in a growable array and exposing methods to submit and query them with basic validation.",
  "feature_evidence.json": "Feature evidence report listing optimization tasks, affected files, components, and test IDs for 3D scene improvements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality and optimization details of various frontend files.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Checklist outlining backend deploy, frontend build, and runtime validation steps plus diagnostic output guidance.",
  "frontend/index.css": "Global Tailwind setup defining light and dark theme CSS variables and applying base styling.",
  "frontend/index.html": "Basic HTML shell mounting the React app via root div and loading main.tsx.",
  "frontend/public/elementor/README-elementor.txt": "Instructions for embedding the static 3D cafe build into WordPress Elementor with notes on features, limitations, and backend integration.",
  "frontend/src/App.tsx": "Main React app managing scene lifecycle, overlays, WebGL checks, and startup watchdog around the 3D environment.",
  "frontend/src/components/layout/ContourFrame.tsx": "Layout wrapper adding a stylized textured frame background around children.",
  "frontend/src/components/layout/PanelSurface.tsx": "Generic overlay panel layout with title bar, close button, and scrollable content using ContourFrame.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip that triggers onboarding overlay display.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar showing logo and buttons to open menu, about, contact, and download panels.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "A dialog overlay showing onboarding instructions for navigating and interacting in the 3D cafe.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Tracks whether the user has seen the onboarding overlay using localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and submitting contact messages with diagnostics and validation.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, typography, dark mode, and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app and wraps it with Internet Identity and React Query providers.",
  "frontend/src/pages/AboutPanel.tsx": "A right-side sheet panel displaying descriptive information about Contour Cafe.",
  "frontend/src/pages/ContactPanel.tsx": "A contact form panel allowing message submission and displaying alternate contact options.",
  "frontend/src/pages/ExportPanel.tsx": "Side panel UI that provides a downloadable WordPress package and installation instructions with alerts and feature notes.",
  "frontend/src/pages/MenuPanel.tsx": "Right-side menu panel showing coffee, pastries, and desserts using tabbed categories and MenuItem components.",
  "frontend/src/scene/CafeScene.tsx": "Main 3D café scene combining fallback room, environment, physics, and interactions with error handling and navigation hooks.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Custom camera navigation hook enabling keyboard and mouse movement with pointer-lock and drag-to-look behavior.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "Minimal static fallback 3D room rendering floor and walls to ensure immediate visual output before full scene loads.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Full café environment with textured floor, walls, furniture, physics integration, and mount logging.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Defines 3D furniture components such as counters, tables, chairs, and stools using Three.js meshes and optional textures.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds cafe props like espresso machines, grinders, display cases, and cups, loading a texture for consistent styling.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "Hook that loads a texture asynchronously, logs outcome, and returns undefined on failure without blocking rendering.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Implements a timeout-based watchdog that triggers a callback if a scene fails to start rendering in time.",
  "frontend/src/scene/interactions/DoorController.tsx": "Controls an auto-opening door that rotates based on camera proximity using per-frame updates.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Provides a draggable, rotatable prop with visual feedback and an HTML hint overlay during inspection.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Aggregates interaction systems including POIs, proximity zones, door logic, inspectables, and panel triggers.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Creates floating interactive props (card, cup, sign) with hover/press effects and optional labels.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Renders interactive POI markers with hover, dwell detection, animations, and panel activation.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Defines POI entries with labels, positions, actions, and highlight colors for scene interaction.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Detects when the camera enters defined zones and displays UI prompts that can trigger panel actions.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Renders interactive 3D panel props that trigger activation of menu, about, or contact panels.",
  "frontend/src/scene/materials/contourStyle.ts": "Provides factory functions for Three.js materials and exports a set of contour-related colors.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "Error boundary that captures rendering errors in the scene and resets when children change.",
  "frontend/src/scene/ui/SceneDegradedOverlay.tsx": "Displays an overlay warning when the full café scene fails to load and offers a retry button.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "Shows a detailed error overlay for scene load failures with optional diagnostics and retry support.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "Shows a loading overlay with spinner and status text while the café scene initializes.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Implements logging utilities for scene load failures and successes, plus formatting for diagnostic stages.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL support and required extensions, returning status and failure reasons.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store managing which UI panel is currently active in the scene.",
  "frontend/src/theme/motion.ts": "Defines motion durations, easings, spring presets, and a helper to build CSS transitions.",
  "frontend/src/theme/tokens.ts": "Exports design tokens for colors, typography, spacing, and radii used across the theme.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Provides utilities for logging deployment errors with context, remediation hints, and step labeling.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugin support for the project.",
  "project_state.json": "Configuration file capturing the project’s current 3D café site state, including features, issues, architectural notes, and image optimization needs. Used to track build problems, scene loading failures, and planned interaction upgrades."
}