{
  "backend/main.mo": "Motoko actor storing contact messages in a list, allowing submissions with validation and retrieval via a query method.",
  "feature_evidence.json": "JSON report listing implemented features, related files, components, and test IDs for deployment evidence.",
  "frontend-file-summaries.txt": "Text file containing prewritten one‑sentence descriptions for various frontend source files.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Markdown checklist outlining steps and diagnostics for validating backend and frontend deployment flow.",
  "frontend/index.css": "Tailwind CSS setup defining base styles, theme variables, and dark mode color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/elementor/README-elementor.txt": "Instructions for embedding the static 3D cafe build into WordPress via Elementor, including setup and limitations.",
  "frontend/src/App.tsx": "Root React component managing overlays, scene startup state, diagnostics, error handling, and rendering the 3D scene within a canvas.",
  "frontend/src/components/layout/ContourFrame.tsx": "Reusable frame component applying contour background texture and styled container around child content.",
  "frontend/src/components/layout/PanelSurface.tsx": "Structured panel wrapper with title bar, close button, scroll area, and ContourFrame styling.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip that triggers onboarding or controls overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar showing logo and buttons to open menu, about, contact, and export panels.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "A dialog overlay that introduces users to basic 3D navigation and interaction tips with a dismiss button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Tracks whether onboarding has been dismissed using localStorage and provides functions to update the flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and submitting contact messages using the backend actor with validation and diagnostics.",
  "frontend/src/index.css": "Global styles defining Tailwind layers, custom color variables, fonts, theming, and reduced‑motion rules.",
  "frontend/src/main.tsx": "Application entry point that initializes React, wraps the app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AboutPanel.tsx": "A right-side sheet showing information about the cafe, its mission, values, and location.",
  "frontend/src/pages/ContactPanel.tsx": "A contact form sheet allowing users to submit messages and view contact details using query and mutation hooks.",
  "frontend/src/pages/ExportPanel.tsx": "Slide‑out panel providing instructions and a download link for a WordPress‑ready static package, plus notes on limitations and setup.",
  "frontend/src/pages/MenuPanel.tsx": "Slide‑out menu panel with tabbed categories (coffee, pastries, desserts) and a MenuItem component displaying item details.",
  "frontend/src/scene/CafeScene.tsx": "Main 3D scene combining fallback geometry, environment loading, physics, and interactions with error logging and navigation support.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Custom hook enabling WASD and mouse‑driven first‑person navigation with pointer‑lock and drag‑to‑look support.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "Lightweight fallback 3D room with floor and walls rendered immediately without dependencies.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Full café environment with textured floor, walls, furniture, physics plane, and a mount callback for readiness.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Defines 3D cafe furniture components (counter, table, chair, stool) using meshes and optional wood texture.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds decorative cafe objects like espresso machine, grinder, display case, and cups using a loaded texture.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "React hook that loads a texture asynchronously, logging errors and leaving undefined on failure.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Watchdog hook that triggers a timeout callback if a scene fails to render within a set duration.",
  "frontend/src/scene/interactions/DoorController.tsx": "Automatically opens and closes a door mesh based on camera proximity with smooth rotation.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Interactive prop that can be dragged to rotate and shows an on-screen hint while inspecting.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Composes all interaction systems, wiring POIs, proximity zones, door control, and props to UI activation.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Displays a floating interactive prop (card, cup, or sign) with hover animations and click handling.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Handles point‑of‑interest markers with hover, dwell detection, animations, and panel activation.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Defines a list of points of interest with positions, labels, and actions for scene interaction.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Detects camera entry into defined zones and shows UI prompts to trigger associated panels.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Renders interactive panel props in the 3D scene that trigger different UI panels when clicked.",
  "frontend/src/scene/materials/contourStyle.ts": "Provides helper functions to create Three.js materials and defines preset contour colors.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "React error boundary that reports scene errors and resets when children change.",
  "frontend/src/scene/ui/SceneDegradedOverlay.tsx": "Displays an overlay warning that only a basic scene loaded and offers a retry button.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "Shows an error overlay for scene load failures with optional diagnostic details and retry support.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "Renders a loading overlay with a spinner and status text while the scene initializes.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Implements diagnostic logging for scene load stages, failures, and success events.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL compatibility and required extensions, returning support status and reasons.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store managing which UI panel is active in the scene overlay.",
  "frontend/src/theme/motion.ts": "Defines motion timing, easing, spring presets, and a helper to generate transition strings.",
  "frontend/src/theme/tokens.ts": "Holds design tokens for colors, typography, spacing, and radii.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Provides utilities for logging deployment-related errors with remediation hints and wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling plugins for the project.",
  "project_state.json": "Tracks the 3D cafe project’s current state, including features, issues, and architectural notes for building an interactive contour-themed environment. Indicates recent deployment failures and missing 3D scene assets, marking the file as a fix request."
}