{
  "backend/main.mo": "Motoko actor storing contact messages with validation and functions to submit and query them.",
  "feature_evidence.json": "Feature evidence report listing scene-related feature tasks, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend source file.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment guide outlining backend deploy, frontend build, runtime flow, and diagnostic formats.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and global element styling.",
  "frontend/index.html": "Root HTML file containing the app mount point and script tag for the frontend entrypoint.",
  "frontend/public/elementor/README-elementor.txt": "Instructions for embedding the static 3D cafe build into WordPress Elementor with deployment notes.",
  "frontend/src/App.tsx": "Main React app composing the 3D scene, navigation bar, overlay panels, and viewport tracking.",
  "frontend/src/components/layout/ContourFrame.tsx": "Reusable styled frame component applying contour texture and visual container effects.",
  "frontend/src/components/layout/PanelSurface.tsx": "Generic overlay panel wrapper with a header, close button, and scrollable content area.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip that triggers the onboarding overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Renders the top navigation bar with logo and buttons that open about, contact, and menu panels.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "A dialog overlay showing onboarding instructions for navigating the 3D cafe with tips and a start button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries on changes.",
  "frontend/src/hooks/useAppViewport.ts": "Sets a CSS variable for viewport height to stabilize layout on mobile browsers and listens for viewport changes.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Tracks whether the user is visiting for the first time using localStorage and provides functions to dismiss onboarding.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, identity loading, status tracking, and logout handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and submitting contact messages with runtime checks and diagnostics.",
  "frontend/src/index.css": "Defines the app’s Tailwind base styles and a warm café-themed color palette with light and dark mode variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the main App component.",
  "frontend/src/pages/AboutPanel.tsx": "Displays an About panel with cafe description, values, and visit information inside a sliding sheet.",
  "frontend/src/pages/ContactPanel.tsx": "Implements a contact form with submission handling, validation, and backend integration within a sheet panel.",
  "frontend/src/pages/ExportPanel.tsx": "Provides a downloadable WordPress static package with instructions and notes about feature limitations.",
  "frontend/src/pages/MenuPanel.tsx": "Shows a tabbed menu of coffee, pastries, and desserts and supports navigation to other panels.",
  "frontend/src/scene/assets/LocalGltfModel.tsx": "Loads and clones local GLTF/GLB models with Suspense support and flexible transform props.",
  "frontend/src/scene/CafeScene.tsx": "Renders the base 3D cafe scene with basic lighting, navigation hooks, and readiness/error callbacks.",
  "frontend/src/scene/characters/CafeCharacters.tsx": "Aggregates cafe character components, currently only rendering dogs.",
  "frontend/src/scene/characters/CafeDogs.tsx": "Places several static dog models around the cafe using DogModel with fixed positions, rotations, and scales.",
  "frontend/src/scene/characters/CafeHumans.tsx": "Places three static human models in the cafe using HumanModel at predefined positions and orientations.",
  "frontend/src/scene/characters/characterMaterials.ts": "Empty placeholder file for character material definitions.",
  "frontend/src/scene/characters/DogCharacter.tsx": "Defines a static primitive dog mesh used as a legacy or fallback model with configurable position, rotation, color, and scale.",
  "frontend/src/scene/characters/DogModel.tsx": "Loads a static dog GLB model with LocalGltfModel and provides a simplified primitive dog fallback.",
  "frontend/src/scene/characters/HumanCharacter.tsx": "Defines a static primitive human mesh used as a legacy or fallback model with optional seated posture.",
  "frontend/src/scene/characters/HumanModel.tsx": "Loads a static human GLB model with LocalGltfModel and includes a basic primitive fallback mesh.",
  "frontend/src/scene/components/MenuBoardFrameGlow.tsx": "Creates a neon emissive outline mesh around a rectangular frame using custom ShapeGeometry.",
  "frontend/src/scene/components/WallFrameLabel.tsx": "Generates a high‑resolution canvas texture containing text and displays it on a plane as a 3D wall label.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Implements first‑person cafe navigation with keyboard movement, mouse/touch look controls, and pointer lock support.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "Renders a minimal fallback café scene with basic walls, floor, lighting, primitive furniture, labels, and contour overlays to ensure guaranteed geometry display.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "Defines the full café environment with physics-backed floor, contour-textured surfaces, wall textures, model-based furniture, scene dressing, and mount diagnostics.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Provides Counter, CafeTable, WoodenChair, and BarStool components using contour-textured materials and model-based or primitive geometry.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Adds decorative café props including the espresso machine, grinder, pastry case, and menu board with neon glow and large label text.",
  "frontend/src/scene/environment/CommercialEspressoMachine.tsx": "Implements a detailed commercial espresso machine model with metal materials, group heads, wands, and tray.",
  "frontend/src/scene/environment/FurnitureModels.tsx": "Defines primitive TableModel and ChairModel components as GLB-free fallbacks for reliable rendering.",
  "frontend/src/scene/HomeCafeCanvas.tsx": "Sets up the Three.js canvas with loading and error overlays, WebGL checks, and mounting of the CafeScene.",
  "frontend/src/scene/hooks/useContourTexture.ts": "Loads and configures contour textures, producing floor, wall, and furniture variants with repeat settings and enhanced filtering.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "Loads a Three.js texture asynchronously with error logging and optional callback, returning undefined on failure.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Sets a timeout to detect stalled scene startup and triggers a callback unless canceled on successful render.",
  "frontend/src/scene/hooks/useWallMapTexture.ts": "Loads a specific wall texture and applies wrapping, filtering, and anisotropy settings.",
  "frontend/src/scene/interactions/DoorController.tsx": "Animates a door opening or closing based on camera proximity using smooth rotation interpolation.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Provides a draggable prop that rotates during inspection and displays an on-screen hint.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Empty placeholder file.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Renders interactive floating props (card, cup, sign) with hover/press feedback and click handling.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Displays rotating POI markers with hover and dwell activation logic linked to camera direction.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Defines a list of POIs with positions, labels, and associated actions.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Detects when the camera enters defined zones and shows UI prompting actions like opening panels.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Empty placeholder file.",
  "frontend/src/scene/materials/contourStyle.ts": "Creates various reusable materials including contour overlays, wood, metal, and standard highlight colors.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "A React error boundary that captures scene errors, increments error counts, and resets on retry.",
  "frontend/src/scene/ui/SceneDegradedOverlay.tsx": "Shows a UI overlay when the scene loads in degraded mode with a retry option.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "Displays an error overlay for failed scene loads with optional diagnostic details and retry button.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "React loading overlay that shows a spinner and, after 8 seconds, a degraded-mode retry panel.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Utilities for logging scene load failures and successes with labeled diagnostic stages.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL availability and required extensions, returning support status and reason.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store managing which UI panel is currently active.",
  "frontend/src/theme/motion.ts": "Defines motion timing, easing, and spring presets plus a helper to build transition strings.",
  "frontend/src/theme/tokens.ts": "Centralized design tokens for colors, typography, spacing, and radii.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Logs deployment-related errors with context, step labeling, and remediation hints.",
  "frontend/tailwind.config.js": "Tailwind config extending theme tokens, colors, fonts, radii, and enabling extra plugins.",
  "frontend/THIRD_PARTY_MODEL_ATTRIBUTION.md": "Documentation listing all third‑party 3D models, sources, licenses, and required local file locations.",
  "project_state.json": "Project state metadata describing scene features, issues, and active fix requests."
}