{
  "backend/main.mo": "Motoko actor storing contact messages with validation, append logic, and a query to return all messages.",
  "feature_evidence.json": "Feature evidence report listing feature definitions, related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles in UI, interactions, and 3D scene systems.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Deployment guide outlining backend, frontend build, and runtime steps plus diagnostic formats.",
  "frontend/index.css": "Tailwind base setup defining CSS variables for light/dark themes and global styling.",
  "frontend/index.html": "Base HTML shell that loads the React app and mounts it into the root element.",
  "frontend/public/elementor/README-elementor.txt": "Instructions for embedding the static 3D cafe build into WordPress via Elementor, including features and limitations.",
  "frontend/src/App.tsx": "Main React app composing the 3D scene, top navigation, overlay panels, viewport handling, and toasts.",
  "frontend/src/components/layout/ContourFrame.tsx": "UI wrapper adding contour‑texture background, framing, blur, and styled container for panels.",
  "frontend/src/components/layout/PanelSurface.tsx": "Reusable panel layout with header, close button, scrollable content area, and adaptive height.",
  "frontend/src/components/nav/HelpButton.tsx": "Floating help button with tooltip that triggers reopening of the onboarding/controls overlay.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar with logo and buttons that trigger overlay panels.",
  "frontend/src/components/overlays/OnboardingOverlay.tsx": "Modal overlay presenting onboarding instructions for navigating the 3D cafe.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to the user's identity, refetching queries when it changes.",
  "frontend/src/hooks/useAppViewport.ts": "Hook that sets a CSS variable for stable viewport height on mobile browsers.",
  "frontend/src/hooks/useFirstVisitFlag.ts": "Manages onboarding state using localStorage to detect and dismiss first-visit onboarding.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication and identity management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and submitting contact messages using the backend actor with diagnostics.",
  "frontend/src/index.css": "Global styles including Tailwind setup, color variables, layout rules, and viewport safety handling.",
  "frontend/src/main.tsx": "App entry point mounting React with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPanel.tsx": "Displays an About panel with cafe info, passion, community, quality, and visit details in a scrollable sheet.",
  "frontend/src/pages/ContactPanel.tsx": "Provides a contact form with validation and backend submission plus a section showing contact details and messages.",
  "frontend/src/pages/ExportPanel.tsx": "Shows WordPress export options including a static package download, instructions, and feature limitations.",
  "frontend/src/pages/MenuPanel.tsx": "Renders a tabbed menu for coffee, pastries, and desserts, with navigation actions to other panels.",
  "frontend/src/scene/assets/LocalGltfModel.tsx": "Loads and clones GLTF models with Suspense support and optional fallback content.",
  "frontend/src/scene/CafeScene.tsx": "Sets up the basic 3D cafe scene with lighting, a fallback room, navigation, and error handling hooks.",
  "frontend/src/scene/characters/CafeCharacters.tsx": "Aggregates human and dog character components into a single group for the cafe scene.",
  "frontend/src/scene/characters/CafeDogs.tsx": "Places two static dog GLB models in fixed cafe positions.",
  "frontend/src/scene/characters/CafeHumans.tsx": "Places three static human GLB models at table, counter, and standing positions.",
  "frontend/src/scene/characters/characterMaterials.ts": "Empty placeholder for character material definitions.",
  "frontend/src/scene/characters/DogCharacter.tsx": "Legacy static primitive dog built from basic meshes, used as a fallback.",
  "frontend/src/scene/characters/DogModel.tsx": "Loads a static dog GLB with a simple primitive fallback if loading fails.",
  "frontend/src/scene/characters/HumanCharacter.tsx": "Legacy static primitive human built from simple meshes with seated support.",
  "frontend/src/scene/characters/HumanModel.tsx": "Loads a static human GLB with a primitive fallback model.",
  "frontend/src/scene/components/MenuBoardFrameGlow.tsx": "Creates a neon-style glowing rectangular frame using emissive edge geometry.",
  "frontend/src/scene/components/WallFrameLabel.tsx": "Renders high‑resolution canvas text as a 3D label on a plane with optional background.",
  "frontend/src/scene/controls/useCafeNavigation.ts": "Custom hook enabling camera movement and drag/pointer‑lock look controls with keyboard and pointer input.",
  "frontend/src/scene/environment/BasicCafeRoomFallback.tsx": "A minimal fallback café scene rendering basic geometry, walls, lighting, and key props without Suspense or physics. Uses contour and wall textures plus simplified furniture and characters to ensure immediate visual output.",
  "frontend/src/scene/environment/CafeEnvironment.tsx": "The full café environment with physics floor, contour-textured surfaces, model-backed furniture, lighting, and wall textures. Signals mount completion and includes ceiling overlays and scene dressing.",
  "frontend/src/scene/environment/CafeFurniture.tsx": "Defines counter, table, chair, and bar stool components using contour textures and model-based furniture with primitive fallbacks. Provides grouped mesh construction for each furniture item.",
  "frontend/src/scene/environment/CafeSceneDressing.tsx": "Renders decorative café props including espresso machine, grinder, pastry case, menu board with glow, and large label text. Applies contour textures where appropriate and preserves metal/glass materials.",
  "frontend/src/scene/environment/CommercialEspressoMachine.tsx": "Builds a detailed commercial espresso machine model with group heads, steam wands, controls, and metallic materials. Designed to sit on the counter with optional contour texture input.",
  "frontend/src/scene/environment/FurnitureModels.tsx": "Provides model-backed table and chair components loading local GLB assets with primitive fallbacks. Defines simple fallback meshes for reliability if model loading fails.",
  "frontend/src/scene/HomeCafeCanvas.tsx": "Hosts the Three.js canvas, manages loading and error states, checks WebGL support, and mounts the CafeScene.",
  "frontend/src/scene/hooks/useContourTexture.ts": "Loads and configures a contour texture with wrapping, filtering, and anisotropy settings. Returns specialized texture variants for floor, wall, and furniture surfaces.",
  "frontend/src/scene/hooks/useNonBlockingTexture.ts": "Loads a texture asynchronously using TextureLoader and reports errors without blocking rendering. Returns the loaded texture or undefined on failure.",
  "frontend/src/scene/hooks/useSceneStartupWatchdog.ts": "Implements a watchdog timer that triggers a timeout callback if the scene fails to render in time. Provides a cancel method to stop the timer on successful render.",
  "frontend/src/scene/hooks/useWallMapTexture.ts": "Loads a specific wall-map texture using the non-blocking loader and applies wrapping, filtering, and anisotropy settings. Returns undefined if loading fails.",
  "frontend/src/scene/interactions/DoorController.tsx": "Animates a door that opens when the camera approaches within a set distance. Smoothly interpolates rotation to target angles.",
  "frontend/src/scene/interactions/InspectableProp.tsx": "Creates an interactable prop that can be rotated by dragging and highlights while inspecting. Displays an HTML tooltip during interaction.",
  "frontend/src/scene/interactions/InteractionManager.tsx": "Empty file placeholder for interaction management logic.",
  "frontend/src/scene/interactions/PanelProp.tsx": "Renders floating, interactive props (card, cup, or sign) with hover/press feedback and optional labels. Triggers a callback when clicked.",
  "frontend/src/scene/interactions/POIMarkers.tsx": "Displays rotating POI markers that react to hover and dwell gaze detection and trigger actions when activated. Uses camera direction and distance for dwell-based activation.",
  "frontend/src/scene/interactions/poiRegistry.ts": "Defines a registry of POIs with positions, labels, actions, and highlight colors. Used for driving POI marker behavior in the scene.",
  "frontend/src/scene/interactions/ProximityZones.tsx": "Defines proximity-based zones that activate when the camera enters them, showing an overlay with an actionable button. Tracks zone entry and exit in real time.",
  "frontend/src/scene/interactions/ScenePanelProps.tsx": "Empty file placeholder for scene panel prop definitions.",
  "frontend/src/scene/materials/contourStyle.ts": "Provides material factory functions for contour, wood, metal, and overlay materials. Includes preset contour color values.",
  "frontend/src/scene/SceneErrorBoundary.tsx": "Error boundary that catches scene render errors, increments error count, and resets on retry.",
  "frontend/src/scene/ui/SceneDegradedOverlay.tsx": "UI overlay shown when only a partial scene loads, explaining the issue and offering a retry button. Uses ContourFrame styling and warning iconography.",
  "frontend/src/scene/ui/SceneErrorOverlay.tsx": "UI overlay for full scene load failures with retry controls and optional technical diagnostics. Supports expandable detail view for debugging information.",
  "frontend/src/scene/ui/SceneLoadingOverlay.tsx": "Displays a loading overlay with a spinner and shows a retry prompt after a timeout, optionally adapting text for room-first mode.",
  "frontend/src/scene/utils/sceneDiagnostics.ts": "Provides logging utilities for scene load failures and successes, including diagnostic formatting and stage labels.",
  "frontend/src/scene/utils/webglSupport.ts": "Checks browser WebGL availability and required extensions, returning support status and failure reasons.",
  "frontend/src/state/uiOverlayStore.ts": "Zustand store managing which UI overlay panel is active and exposing a setter.",
  "frontend/src/theme/motion.ts": "Defines motion timing values and easing curves and provides a helper to build transition strings.",
  "frontend/src/theme/tokens.ts": "Exports design tokens for colors, typography, spacing, and radii used throughout the theme.",
  "frontend/src/utils/deploymentDiagnostics.ts": "Logs detailed deployment-related errors with context, step labels, and remediation hints for backend, frontend, and runtime issues.",
  "frontend/tailwind.config.js": "Tailwind configuration with extended colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "frontend/THIRD_PARTY_MODEL_ATTRIBUTION.md": "Attribution document listing all third‑party 3D models, sources, licenses, and storage locations.",
  "project_state.json": "Project metadata describing 3D static-character requirements, existing features, and pending asset-related feature requests."
}