{
  "kind": "build_request",
  "title": "Add humans and pet dogs to the 3D cafe scene",
  "projectName": "Contour Cafe",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add 3D human characters to the cafe scene, including at least: (a) seated customers at tables, (b) a customer waiting at the counter, and (c) a walking customer moving through the cafe.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add humans into the cafe sitting or waiting at counter or walking, also add pet dogs with them"
        ]
      },
      "acceptanceCriteria": [
        "When the scene loads, at least three distinct human characters are visible in the cafe.",
        "At least one human is positioned to appear seated at an existing table/chair cluster.",
        "At least one human is positioned near the counter area to appear as waiting at the counter.",
        "At least one human has a subtle walking/idle animation (e.g., looped step cycle or small positional movement) that runs continuously without user input.",
        "Characters are placed so they do not block the camera spawn/typical navigation path or clip heavily into the floor/furniture."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add 3D pet dog characters accompanying the humans in the cafe scene (e.g., sitting/standing near seated humans and near the counter), with simple idle motion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...also add pet dogs with them"
        ]
      },
      "acceptanceCriteria": [
        "When the scene loads, at least two dog characters are visible.",
        "At least one dog is placed near a seated human and at least one dog is placed near a standing/waiting human (counter area or walking path).",
        "Dogs have a subtle idle animation (e.g., tail wag, head bob, or breathing) that runs continuously without user input.",
        "Dog scale and placement are visually consistent with the cafe environment (not oversized, not below the floor)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the added humans and dogs render in the currently active cafe scene path (the always-available basic room/fallback scene), and keep performance stable on typical devices.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Humans and dogs appear in the basic room experience that currently renders by default.",
        "No runtime errors are introduced in the 3D scene (console remains free of new scene-related exceptions during load and during animation loops).",
        "Character geometry/material complexity is kept lightweight enough to avoid noticeable frame drops compared to before the change."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui (compose instead of editing if needed).",
    "Keep all changes within the existing single-frontend React Three Fiber scene architecture; no new backend services."
  ],
  "nonGoals": [
    "Adding character customization UI (choosing outfits, breeds, names, etc.).",
    "Adding dialogue, quests, or interactive NPC behavior beyond simple idle/walk animations.",
    "Adding physics-based collisions for characters."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}