{
  "kind": "build_request",
  "title": "Add alternate no-seating cafe layout and neon 'Menu' counter text in both WebGL and fallback rooms",
  "projectName": "Contour Cafe",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an alternate café room layout variant that contains no chairs and no tables, while keeping the rest of the room (walls, floor, counter, and other non-seating props) intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "same just add a alternate UI with no chairs or table in the cafe"
        ]
      },
      "acceptanceCriteria": [
        "A user can switch between the current café layout and an alternate layout.",
        "In the alternate layout, no table meshes and no chair meshes are rendered in the room.",
        "The alternate layout still renders the counter and the rest of the room so the scene does not feel empty."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Render the word \"Menu\" on the counter front face in the 3D scene, styled as bold white text with a green neon glow/shadow effect, using a font size equivalent to 70px.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also add the word Menu written on the counter frontface and make it font size 70px and font color white bold and green neon shoadow"
        ]
      },
      "acceptanceCriteria": [
        "The counter has a visible \"Menu\" label on its front face (not floating in space or placed on a wall/menu board).",
        "The \"Menu\" label appears bold, white, and includes a green neon glow/shadow effect.",
        "The label size matches the requested 70px styling intent (visually comparable to ~70px UI text at typical viewing distance), and remains legible."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Apply the alternate no-seating layout and the \"Menu\" counter-front label consistently in both the WebGL-enabled room and the non-WebGL/basic fallback room implementation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "do same for normal 3d room with web GL"
        ]
      },
      "acceptanceCriteria": [
        "When WebGL is supported, the selected room layout (standard vs alternate) is reflected in the rendered 3D room.",
        "When WebGL is not supported and the non-WebGL/basic room experience is shown, the same selected layout (standard vs alternate) is reflected (including no chairs/tables in the alternate layout).",
        "The \"Menu\" counter-front label appears in both the WebGL-supported experience and the fallback/basic room."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not modify immutable hook entrypoints listed in SYSTEM_CONTEXT (compose around them instead).",
    "Backend architecture must remain a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Adding new backend endpoints or persistence for this change.",
    "Adding or changing the food/drink menu content in the UI panels (this request is only about 3D room layout/signage).",
    "Adding new 3D characters, animations, physics interactions, or real-time multiplayer features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}