{
  "kind": "build_request",
  "title": "Add coffee machine prop on the counter",
  "projectName": "Contour Cafe",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a visible 3D coffee/espresso machine prop on top of the counter in the always-rendered fallback scene so users can see it on the counter during normal app usage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Where is the coffee machine on the counter? Add it"
        ]
      },
      "acceptanceCriteria": [
        "In the default rendered scene (the basic fallback room), a coffee/espresso machine mesh is present on the counter surface (on top of the counter, not intersecting the counter body).",
        "The coffee/espresso machine renders with a shiny silver/chrome look (high metalness, low roughness) consistent with the existing machine styling.",
        "The prop casts/receives shadows consistently with the other countertop props (when shadows are enabled in the scene)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the coffee/espresso machine prop position is aligned with the existing counter placement so it appears correctly on the counter (z aligned with the counter group at z = -5) and does not overlap existing fallback countertop props (cups, to-go cups, syrup bottles).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Where is the coffee machine on the counter? Add it"
        ]
      },
      "acceptanceCriteria": [
        "The coffee/espresso machine is placed at a stable position on the counter top in the fallback scene and is not visually colliding with the fallback cups/to-go cups/syrup bottles.",
        "The coffee/espresso machine remains visible from the default camera starting view without requiring navigation."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify the Internet Identity hooks (frontend/src/hooks/useInternetIdentity.ts / .tsx) or actor hook (frontend/src/hooks/useActor.ts) which are immutable paths.",
    "Keep all changes within the existing React + React Three Fiber scene code; no external 3D asset pipelines or external services."
  ],
  "nonGoals": [
    "Adding backend state or APIs for the coffee machine.",
    "Adding new interactions (inspect, click, hover UI) for the coffee machine.",
    "Refactoring the scene to enable the full environment stack beyond what is required to make the coffee machine visible on the counter."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}