{
  "kind": "build_request",
  "title": "Fix blank 3D cafe by making full environment load resilient and correctly tracked",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Prevent the app from marking the scene as “ready” when only the minimal fallback room has rendered; keep the loading overlay visible until the full café environment (furniture + dressing) has mounted successfully, and only then set `sceneReady` in `frontend/src/App.tsx`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "now it is just blank room"
        ]
      },
      "acceptanceCriteria": [
        "When the app first loads, the loading overlay remains visible until the full cafe environment content (e.g., counter/tables/scene dressing) is present, not just the basic fallback floor/walls.",
        "If the full cafe environment never mounts, the app does not permanently hide the loading overlay without showing a user-visible status/error state (see REQ-34).",
        "No changes are made to immutable paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Make `frontend/src/scene/environment/CafeSceneDressing.tsx` non-blocking and non-suspending by removing Suspense-based texture loading (`useTexture`) for `/assets/generated/contour-texture-warm.dim_2048x2048.png`, and instead use the existing non-blocking texture loader hook so that missing/slow textures cannot prevent the rest of the café props from rendering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "now it is just blank room"
        ]
      },
      "acceptanceCriteria": [
        "The cafe scene dressing props (espresso machine, grinder, pastry case, lights, etc.) still render even if `/assets/generated/contour-texture-warm.dim_2048x2048.png` is slow to load or fails to load.",
        "A failed texture load is logged via existing scene diagnostics (stage `texture-load`) and does not crash the scene.",
        "No React Suspense stall occurs solely due to the dressing texture."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add a user-visible degraded-mode state for when the full café environment (the content inside the `Physics` + Suspense block in `frontend/src/scene/CafeScene.tsx`) does not appear within the startup timeout: show clear English text indicating that only a basic room could be loaded and provide an in-app action to retry loading/remounting the scene.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "now it is just blank room"
        ]
      },
      "acceptanceCriteria": [
        "If the app renders only the fallback room and the full cafe environment does not become visible within the configured startup timeout window, the user sees an overlay or banner with clear English text indicating the cafe details did not load.",
        "The degraded-mode UI includes a Retry action that remounts the scene (reuses the existing retry/remount mechanism in `frontend/src/App.tsx`).",
        "Retrying clears the degraded-mode UI and attempts to load the full cafe environment again.",
        "This degraded-mode state does not block interaction when the full environment eventually loads successfully; once loaded, the degraded-mode UI disappears automatically."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Improve scene diagnostics to explicitly distinguish “fallback room rendered” vs “full café environment mounted,” and record a diagnostic event when the full environment mount does not occur so deploy regressions (blank room) can be identified from console logs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "now it is just blank room"
        ]
      },
      "acceptanceCriteria": [
        "Console diagnostics include an explicit success log when the full cafe environment mounts (separate from the first frame render).",
        "If the full cafe environment fails to mount, diagnostics include a clear stage + message indicating the full environment did not mount (without requiring a thrown exception).",
        "Existing error overlay ‘Technical Details’ remains compatible and displays the latest relevant stage/message when applicable."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths listed in SYSTEM_CONTEXT must not be edited; compose existing UI components instead.",
    "All user-facing text introduced/changed by this request must be in English."
  ],
  "nonGoals": [
    "Adding new 3D gameplay mechanics or new UI panels beyond a degraded-mode message and retry flow.",
    "Backend/canister changes (this issue is treated as a frontend scene loading/resiliency problem unless a separate backend error is identified)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}