{
  "kind": "build_request",
  "title": "Fix regression: 3D cafe room no longer visible after latest deploy",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Restore the visible 3D cafe room by ensuring the main scene always renders some geometry (at minimum: a floor and walls) even if async scene elements (Environment preset, textures, Physics children, or other Suspense content) are still loading or fail.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "3d room is gone"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load, the user never sees an empty/blank view where the 3D room should be; at minimum a basic floor/walls render behind the UI while remaining assets load.",
        "If the Drei Environment preset fails to load, the scene still renders with basic lights and visible geometry (no blank 3D view).",
        "If any async scene element throws/blocks, the app still shows a visible fallback 3D room rather than only the header/UI over a flat background."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Add a timed “scene startup watchdog” in the app shell so that if the 3D scene does not signal first successful render within a defined timeout, the app switches from the loading overlay to a user-visible error overlay with clear English text and a Retry action that remounts the Canvas/scene.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "3d room is gone"
        ]
      },
      "acceptanceCriteria": [
        "If `onFirstRender` is not called within the timeout, the loading overlay is replaced by an error overlay explaining the scene did not finish loading and offering “Retry Loading Scene”.",
        "Clicking Retry clears the error, remounts the Canvas (new key), and re-attempts loading the scene.",
        "If the scene later renders successfully, the loading/error overlays are removed and the 3D room is visible."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Improve scene failure diagnostics so it is easier to determine why the 3D room disappeared after deploy: log and categorize failures for environment loading, asset/texture loading, and scene render, and include a concise ‘details’ section in the error overlay that shows the latest stage + message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "3d room is gone"
        ]
      },
      "acceptanceCriteria": [
        "When a scene failure occurs, console logs include a clearly labeled stage (e.g., webgl-init, environment-load, texture-load, asset-load, scene-render) and the error message/stack when available.",
        "The error overlay includes a readable details area showing the most recent failure stage and message (in English).",
        "The displayed diagnostic details update after a Retry attempt (i.e., old error details do not persist if the new attempt fails differently)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Keep all backend logic in the existing single Motoko actor (backend changes are not required for this fix unless a direct cause is discovered)."
  ],
  "nonGoals": [
    "Adding new 3D interactions, new panels/pages, or changing the cafe layout/design beyond what is necessary to make the 3D room reliably visible again.",
    "Introducing any new backend storage/schema changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}