{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Contour Cafe: larger Seven Balance wall-frame label + neon green frame edge glow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make the \"Seven Balance\" WallFrameLabel text significantly larger and keep it crisp/centered in both BasicCafeRoomFallback and CafeSceneDressing.",
      "acceptanceCriteria": [
        "In the BasicCafeRoomFallback menu board label, the rendered \"Seven Balance\" text is visibly larger than before and remains crisp (not blurry/pixelated) when viewed from the default camera position.",
        "In the CafeSceneDressing menu board label, the rendered \"Seven Balance\" text is visibly larger than before and remains crisp (not blurry/pixelated) when viewed from the default camera position.",
        "The text remains centered on the label plane and does not clip outside the label area."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/components/WallFrameLabel.tsx",
          "operation": "modify",
          "description": "Improve label texture sharpness and fit: increase effective texture resolution for large text, add safe padding/margins, and ensure the canvas text rendering stays centered and does not clip when using a larger fontSize."
        },
        {
          "path": "frontend/src/scene/environment/BasicCafeRoomFallback.tsx",
          "operation": "modify",
          "description": "Increase the \"Seven Balance\" WallFrameLabel sizing for the fallback menu board (e.g., larger fontSize and/or label plane dimensions) while keeping the label centered and within the board area."
        },
        {
          "path": "frontend/src/scene/environment/CafeSceneDressing.tsx",
          "operation": "modify",
          "description": "Increase the \"Seven Balance\" WallFrameLabel sizing for the full scene menu board (e.g., larger fontSize and/or label plane dimensions) while keeping the label centered and within the board area."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a neon green glow effect on the menu board frame edge in both BasicCafeRoomFallback and CafeSceneDressing without z-fighting.",
      "acceptanceCriteria": [
        "In BasicCafeRoomFallback, the menu board frame edge shows a clearly visible neon green glow when viewed from the default camera position.",
        "In CafeSceneDressing, the menu board frame edge shows a clearly visible neon green glow when viewed from the default camera position.",
        "The glow effect is applied to the frame edge (not the whole wall/board surface) and does not introduce obvious z-fighting artifacts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/components/MenuBoardFrameGlow.tsx",
          "operation": "create",
          "description": "Create a small reusable 3D helper component that renders a neon-green edge-glow around a rectangular frame (e.g., via an edge/outline render and/or a slightly offset emissive halo geometry) with parameters to avoid z-fighting."
        },
        {
          "path": "frontend/src/scene/environment/BasicCafeRoomFallback.tsx",
          "operation": "modify",
          "description": "Wire the new MenuBoardFrameGlow component into the fallback menu board group so only the frame edge gets a visible neon green glow, using slight positional/size offsets to prevent z-fighting."
        },
        {
          "path": "frontend/src/scene/environment/CafeSceneDressing.tsx",
          "operation": "modify",
          "description": "Wire the new MenuBoardFrameGlow component into the full scene menu board group so only the frame edge gets a visible neon green glow, using slight positional/size offsets to prevent z-fighting."
        }
      ]
    }
  ]
}