{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Contour Cafe: Static bundled 3D models for humans/dogs/furniture (no character movement)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all human movement and per-frame transform updates so humans remain static in place.",
      "acceptanceCriteria": [
        "No human character changes position or rotation over time (no walk loops).",
        "The scene renders without using any per-frame animation logic for humans (no HumanCharacter movement/idle animation affecting transforms).",
        "At least the same number of human figures remain visible in the scene as before (seated + standing/waiting equivalent placements)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/characters/CafeHumans.tsx",
          "operation": "modify",
          "description": "Remove the walking customer placement/behavior and ensure only static human placements are used (keep at least the same count by adding an additional static human if needed)."
        },
        {
          "path": "frontend/src/scene/characters/HumanCharacter.tsx",
          "operation": "modify",
          "description": "Remove/disable all useFrame-driven transform animation logic so this component never updates transforms per-frame (or convert it into a purely static fallback renderer if kept for graceful model-load fallback)."
        },
        {
          "path": "frontend/src/scene/characters/HumanModel.tsx",
          "operation": "create",
          "description": "Create a static human GLB/GLTF renderer component that loads a local model from frontend static assets and renders it without any per-frame animation; include a non-animated primitive fallback if loading fails."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace primitive humans and dogs with locally bundled free-to-use GLB/GLTF models loaded from static assets with graceful fallback.",
      "acceptanceCriteria": [
        "Human and dog visuals come from imported GLB/GLTF files stored under frontend/public (or another frontend-static location) and are not downloaded from Google or any external host at runtime.",
        "The cafe scene shows at least 3 human models and at least 2 dog models placed similarly to the current layout.",
        "Models load successfully with a graceful fallback (the scene still renders if a model fails to load)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/models/humans/human-01.glb",
          "operation": "create",
          "description": "Add a free-to-use human GLB model file as a bundled static asset (do not hotlink at runtime)."
        },
        {
          "path": "frontend/public/assets/models/humans/human-02.glb",
          "operation": "create",
          "description": "Add a second free-to-use human GLB model file as a bundled static asset (do not hotlink at runtime)."
        },
        {
          "path": "frontend/public/assets/models/humans/human-03.glb",
          "operation": "create",
          "description": "Add a third free-to-use human GLB model file as a bundled static asset (do not hotlink at runtime)."
        },
        {
          "path": "frontend/public/assets/models/dogs/dog-01.glb",
          "operation": "create",
          "description": "Add a free-to-use dog GLB model file as a bundled static asset (do not hotlink at runtime)."
        },
        {
          "path": "frontend/public/assets/models/dogs/dog-02.glb",
          "operation": "create",
          "description": "Add a second free-to-use dog GLB model file as a bundled static asset (do not hotlink at runtime)."
        },
        {
          "path": "frontend/src/scene/assets/LocalGltfModel.tsx",
          "operation": "create",
          "description": "Create a reusable local GLB/GLTF loader/render helper for @react-three/fiber that loads from frontend/public and returns a graceful fallback mesh on error. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/scene/characters/CafeHumans.tsx",
          "operation": "modify",
          "description": "Switch human placements to use the new HumanModel (GLB/GLTF) component(s) pointing at local static assets; keep placements similar to current seated/waiting equivalents and ensure at least 3 humans are shown."
        },
        {
          "path": "frontend/src/scene/characters/CafeDogs.tsx",
          "operation": "modify",
          "description": "Switch dog placements to use a new DogModel (GLB/GLTF) component(s) pointing at local static assets; keep placements similar to current layout and ensure at least 2 dogs are shown."
        },
        {
          "path": "frontend/src/scene/characters/DogModel.tsx",
          "operation": "create",
          "description": "Create a static dog GLB/GLTF renderer component that loads a local model from frontend static assets; include a non-animated primitive fallback if loading fails."
        },
        {
          "path": "frontend/src/scene/characters/DogCharacter.tsx",
          "operation": "modify",
          "description": "Remove/disable all useFrame-driven idle transform animation logic so the legacy primitive dog (if still used as fallback) remains fully static and does not update transforms per-frame."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace procedural tables/chairs with locally bundled free-to-use GLB/GLTF furniture models in both the basic fallback room and full cafe environment.",
      "acceptanceCriteria": [
        "Tables and chairs visible in BasicCafeRoomFallback and CafeEnvironment render using imported 3D model assets rather than box/cylinder primitive geometry for those items.",
        "Furniture models are placed and scaled so the seating areas remain navigable (no major blocking of the camera corridor).",
        "The build succeeds and the scene renders without runtime errors related to asset loading."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/models/furniture/table-chair-set.glb",
          "operation": "create",
          "description": "Add a free-to-use table/chair set GLB model file as a bundled static asset (do not hotlink at runtime)."
        },
        {
          "path": "frontend/src/scene/environment/FurnitureModels.tsx",
          "operation": "create",
          "description": "Create model-backed furniture components (e.g., TableModel, ChairModel, optionally a combined SetModel) that load local GLB/GLTF assets and provide a primitive fallback if model loading fails."
        },
        {
          "path": "frontend/src/scene/environment/CafeFurniture.tsx",
          "operation": "modify",
          "description": "Update CafeTable and WoodenChair to primarily render using the bundled GLB/GLTF furniture models (with graceful fallback), while preserving existing public props (position/rotation) so existing scene layout code continues to work."
        },
        {
          "path": "frontend/src/scene/environment/BasicCafeRoomFallback.tsx",
          "operation": "modify",
          "description": "Ensure all table/chair instances in the basic fallback room render via the updated model-backed CafeTable/WoodenChair components (and adjust scale/placement if necessary to preserve navigable corridors)."
        },
        {
          "path": "frontend/src/scene/environment/CafeEnvironment.tsx",
          "operation": "modify",
          "description": "Ensure all table/chair instances in the full environment render via the updated model-backed CafeTable/WoodenChair components (and adjust scale/placement if necessary to avoid blocking the camera corridor)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add repository attribution/license documentation for each third-party 3D model used (humans, dogs, furniture).",
      "acceptanceCriteria": [
        "There is a committed attribution document listing each model, its original source URL, author/creator (if available), and license.",
        "Attribution entries cover: at least one human model source, one dog model source, and one table/chair set source."
      ],
      "file_operations": [
        {
          "path": "frontend/THIRD_PARTY_MODEL_ATTRIBUTION.md",
          "operation": "create",
          "description": "Add an attribution/license record for each bundled third-party model (humans, dogs, table/chair set), including source URL, author/creator (if available), and license type."
        }
      ]
    }
  ]
}