{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Optimize 3D cafe scene assets and rendering for more reliable startup",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Swap the 3D scene contour texture to a smaller generated file and update scene references to the new filename.",
      "acceptanceCriteria": [
        "The project includes a smaller contour texture file in `frontend/public/assets/generated/` and the 3D scene loads it instead of the 2048x2048 version.",
        "No runtime errors occur due to missing texture assets; if the texture fails to load, the scene still renders with the existing safe material fallback behavior (texture undefined).",
        "The frontend build completes successfully with the updated asset path(s)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/contour-texture-warm.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the downscaled contour texture asset so the 3D scene can load `frontend/public/assets/generated/contour-texture-warm.dim_1024x1024.png` instead of the 2048x2048 version."
        },
        {
          "path": "frontend/src/scene/environment/CafeEnvironment.tsx",
          "operation": "modify",
          "description": "Update the contour texture load path to use `/assets/generated/contour-texture-warm.dim_1024x1024.png` and ensure existing safe fallback behavior remains unchanged if the texture fails to load."
        },
        {
          "path": "frontend/src/scene/environment/CafeSceneDressing.tsx",
          "operation": "modify",
          "description": "Update the contour texture load path to use `/assets/generated/contour-texture-warm.dim_1024x1024.png` and ensure existing safe fallback behavior remains unchanged if the texture fails to load."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Lower geometric segment counts for high-segment primitives in the cafe environment, dressing, and furniture while preserving overall shape and layout.",
      "acceptanceCriteria": [
        "Segment counts are reduced across the environment/furniture/dressing components (visible in code changes) without breaking the scene layout or interactivity.",
        "The scene renders successfully and the environment still looks like a café (no missing meshes, no obviously broken geometry).",
        "The scene reaches the “full-environment-mount” success path under normal conditions (i.e., does not consistently fall into degraded mode due to timeouts)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/environment/CafeEnvironment.tsx",
          "operation": "modify",
          "description": "Reduce segment counts on high-segment primitives (e.g., cylinderGeometry/coneGeometry) used in the environment while keeping positions, scales, and layout intact."
        },
        {
          "path": "frontend/src/scene/environment/CafeSceneDressing.tsx",
          "operation": "modify",
          "description": "Reduce segment counts on high-segment primitives (e.g., cylinderGeometry/torusGeometry/sphereGeometry/coneGeometry) used in scene dressing props while keeping the prop placement and silhouette consistent."
        },
        {
          "path": "frontend/src/scene/environment/CafeFurniture.tsx",
          "operation": "modify",
          "description": "Reduce segment counts on furniture primitives (e.g., table cylinders, stool torus/cylinders, chair legs) while preserving furniture shapes and scene layout."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Adjust React Three Fiber Canvas configuration to reduce rendering workload by capping DPR and disabling expensive rendering features not required for functionality.",
      "acceptanceCriteria": [
        "The `Canvas` in `frontend/src/App.tsx` is configured with a capped DPR (e.g., a lower max DPR than the browser default).",
        "The 3D scene remains functional (navigation, panel props, interactions still work), and user-facing overlays continue to display English text as they do now.",
        "On typical modern browsers, the scene is less likely to hit the startup watchdog timeout compared to before these changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the React Three Fiber `Canvas` to use a capped DPR (e.g., `dpr={[1, 1.5]}`) and apply more conservative WebGL settings (e.g., disable antialiasing and other non-essential features) to reduce GPU/rendering cost without changing UI overlays or interaction behavior."
        }
      ]
    }
  ]
}