{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Contour Cafe — Add lightweight human + dog characters to the basic 3D cafe room",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add at least three distinct 3D human characters (seated, counter-waiting, and walking) to the basic cafe scene with subtle continuous animation.",
      "acceptanceCriteria": [
        "When the scene loads, at least three distinct human characters are visible in the cafe.",
        "At least one human is positioned to appear seated at an existing table/chair cluster.",
        "At least one human is positioned near the counter area to appear as waiting at the counter.",
        "At least one human has a subtle walking/idle animation (e.g., looped step cycle or small positional movement) that runs continuously without user input.",
        "Characters are placed so they do not block the camera spawn/typical navigation path or clip heavily into the floor/furniture."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/characters/HumanCharacter.tsx",
          "operation": "create",
          "description": "Create a lightweight, low-poly HumanCharacter React Three Fiber component (built from simple primitives) supporting variants (colors/props), seated pose option, and subtle idle/walk animation via useFrame. Optimize for reuse (shared geometries/materials) to keep render cost low."
        },
        {
          "path": "frontend/src/scene/characters/CafeHumans.tsx",
          "operation": "create",
          "description": "Create a CafeHumans placement component that instantiates: (1) a seated customer positioned at an existing table/chair cluster, (2) a waiting customer positioned near the counter, and (3) a walking customer following a small looping path through open floor space. Ensure placements avoid the camera’s typical navigation corridor and minimize clipping."
        },
        {
          "path": "frontend/src/scene/environment/BasicCafeRoomFallback.tsx",
          "operation": "modify",
          "description": "Wire the new CafeHumans component into the always-available basic room scene so the seated/waiting/walking humans render on default load (room-first mode)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add at least two 3D pet dog characters near the humans with subtle continuous idle motion.",
      "acceptanceCriteria": [
        "When the scene loads, at least two dog characters are visible.",
        "At least one dog is placed near a seated human and at least one dog is placed near a standing/waiting human (counter area or walking path).",
        "Dogs have a subtle idle animation (e.g., tail wag, head bob, or breathing) that runs continuously without user input.",
        "Dog scale and placement are visually consistent with the cafe environment (not oversized, not below the floor)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/characters/DogCharacter.tsx",
          "operation": "create",
          "description": "Create a lightweight DogCharacter React Three Fiber component (simple primitives, low segment counts) with subtle idle animation (tail wag / head bob / breathing) driven by useFrame. Share geometries/materials across instances for performance."
        },
        {
          "path": "frontend/src/scene/characters/CafeDogs.tsx",
          "operation": "create",
          "description": "Create a CafeDogs placement component that positions at least two dogs: one near the seated human/table area and one near the counter-waiting human or along the walking human’s path. Tune scale and Y offsets to avoid sinking below the floor."
        },
        {
          "path": "frontend/src/scene/environment/BasicCafeRoomFallback.tsx",
          "operation": "modify",
          "description": "Wire the new CafeDogs component into the basic room scene alongside the humans so dogs render by default and appear near the intended human positions."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure humans and dogs render in the default basic room scene and keep performance stable with no new runtime errors.",
      "acceptanceCriteria": [
        "Humans and dogs appear in the basic room experience that currently renders by default.",
        "No runtime errors are introduced in the 3D scene (console remains free of new scene-related exceptions during load and during animation loops).",
        "Character geometry/material complexity is kept lightweight enough to avoid noticeable frame drops compared to before the change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/characters/characterMaterials.ts",
          "operation": "create",
          "description": "Add shared, memo-friendly material/geometry helpers for character primitives (humans + dogs) to minimize allocations and keep draw calls/material count low (e.g., reuse a small palette of materials)."
        },
        {
          "path": "frontend/src/scene/characters/CafeCharacters.tsx",
          "operation": "create",
          "description": "Create a single CafeCharacters aggregator that composes CafeHumans and CafeDogs, centralizes placement constants, and provides a single mount point for the basic room scene to reduce wiring complexity and avoid accidental omissions."
        },
        {
          "path": "frontend/src/scene/environment/BasicCafeRoomFallback.tsx",
          "operation": "modify",
          "description": "Mount CafeCharacters inside the basic fallback room group and verify placements don’t intersect major furniture volumes, don’t block the typical navigation path, and keep shadows/segments conservative to maintain stable performance."
        }
      ]
    }
  ]
}