{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix regression: ensure 3D cafe room always visible with watchdog + diagnostics",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Ensure the 3D cafe scene always renders a visible fallback room (floor + walls) even if async scene elements suspend, fail, or throw.",
      "acceptanceCriteria": [
        "On a fresh load, the user never sees an empty/blank view where the 3D room should be; at minimum a basic floor/walls render behind the UI while remaining assets load.",
        "If the Drei Environment preset fails to load, the scene still renders with basic lights and visible geometry (no blank 3D view).",
        "If any async scene element throws/blocks, the app still shows a visible fallback 3D room rather than only the header/UI over a flat background."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/environment/BasicCafeRoomFallback.tsx",
          "operation": "create",
          "description": "Create a minimal always-available fallback room (floor + 3 walls) using simple R3F meshes/materials (no Physics, no Suspense dependencies) so some geometry is always visible."
        },
        {
          "path": "frontend/src/scene/CafeScene.tsx",
          "operation": "modify",
          "description": "Render the new BasicCafeRoomFallback outside any Suspense/Physics blocks so it appears immediately and remains visible even if Environment/Physics children suspend or error; keep basic lights active regardless of Environment availability."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Add a timed scene startup watchdog that swaps the loading overlay for an error overlay if first render does not occur in time, with Retry remounting the Canvas/scene.",
      "acceptanceCriteria": [
        "If `onFirstRender` is not called within the timeout, the loading overlay is replaced by an error overlay explaining the scene did not finish loading and offering “Retry Loading Scene”.",
        "Clicking Retry clears the error, remounts the Canvas (new key), and re-attempts loading the scene.",
        "If the scene later renders successfully, the loading/error overlays are removed and the 3D room is visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/hooks/useSceneStartupWatchdog.ts",
          "operation": "create",
          "description": "Add a small hook that starts a timeout per scene mount attempt and triggers a provided callback if onFirstRender hasn’t occurred before the timeout; supports resetting per retry/remount."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Integrate the startup watchdog into the app shell: on each sceneKey change start the timer; if it fires, replace the loading overlay with the error overlay and enable a Retry action that increments the Canvas key to remount."
        },
        {
          "path": "frontend/src/scene/ui/SceneErrorOverlay.tsx",
          "operation": "modify",
          "description": "Ensure the overlay messaging clearly indicates the scene did not finish loading within the timeout and keeps the existing “Retry Loading Scene” action (compose using existing shadcn-ui Button; verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Improve scene failure diagnostics by categorizing failures by stage and showing latest stage+message in the error overlay details area, updating across retries.",
      "acceptanceCriteria": [
        "When a scene failure occurs, console logs include a clearly labeled stage (e.g., webgl-init, environment-load, texture-load, asset-load, scene-render) and the error message/stack when available.",
        "The error overlay includes a readable details area showing the most recent failure stage and message (in English).",
        "The displayed diagnostic details update after a Retry attempt (i.e., old error details do not persist if the new attempt fails differently)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/utils/sceneDiagnostics.ts",
          "operation": "modify",
          "description": "Export the failure stage type and extend logging utilities to support consistent stage labeling (including startup/watchdog-related failures) and standardized message formatting for environment/texture/asset/render stages."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Track and reset the latest diagnostic stage+message per scene attempt; wire this into SceneErrorOverlay as a ‘details’ section source, and clear/update it on Retry and on subsequent failures/success."
        },
        {
          "path": "frontend/src/scene/CafeScene.tsx",
          "operation": "modify",
          "description": "Add stage-specific failure reporting hooks for environment loading and scene render errors so failures are categorized (environment-load, scene-render, asset-load where applicable) and forwarded to the app shell diagnostics state."
        },
        {
          "path": "frontend/src/scene/hooks/useNonBlockingTexture.ts",
          "operation": "modify",
          "description": "Augment texture-load failure/success logging to optionally report the latest stage+message to the app shell diagnostics state (while preserving current non-blocking behavior and fallbacks)."
        },
        {
          "path": "frontend/src/scene/ui/SceneErrorOverlay.tsx",
          "operation": "modify",
          "description": "Add a concise, readable ‘details’ area that displays the most recent diagnostic stage + message, and ensure it reflects the latest attempt after Retry (compose using existing shadcn-ui primitives such as Button; verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}