{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Contour Cafe — Coffee machine prop in fallback counter scene",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a visible shiny silver/chrome espresso machine prop on top of the counter in the always-rendered fallback room scene.",
      "acceptanceCriteria": [
        "In the default rendered scene (the basic fallback room), a coffee/espresso machine mesh is present on the counter surface (on top of the counter, not intersecting the counter body).",
        "The coffee/espresso machine renders with a shiny silver/chrome look (high metalness, low roughness) consistent with the existing machine styling.",
        "The prop casts/receives shadows consistently with the other countertop props (when shadows are enabled in the scene)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/environment/BasicCafeRoomFallback.tsx",
          "operation": "modify",
          "description": "Add an espresso machine prop group to the fallback countertop props, using meshStandardMaterial configured for a chrome look (high metalness, low roughness), and ensure meshes have castShadow/receiveShadow set consistently with existing props."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Position the fallback espresso machine so it aligns with the counter group (z aligned to the counter at z = -5), avoids overlapping existing fallback props, and is visible from the default camera view.",
      "acceptanceCriteria": [
        "The coffee/espresso machine is placed at a stable position on the counter top in the fallback scene and is not visually colliding with the fallback cups/to-go cups/syrup bottles.",
        "The coffee/espresso machine remains visible from the default camera starting view without requiring navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/scene/environment/BasicCafeRoomFallback.tsx",
          "operation": "modify",
          "description": "Set the espresso machine group's position so its z aligns with the counter placement (z = -5) while choosing x/z offsets that avoid the existing fallback prop clusters (cups/to-go cups/syrup bottles) and keep it in view from the default camera start."
        }
      ]
    }
  ]
}